In [1]:
import pandas as pd
import sqlite3

In [2]:
create_table_statement = """
    CREATE TABLE student_score
    (
        Id INTEGER, 
        Name VARCHAR(20), 
        Math REAL, 
        Science REAL
    );
"""

In [3]:
connection = sqlite3.connect(':memory:')

In [4]:
connection.execute(create_table_statement)
connection.commit()

In [5]:
select_statement = connection.execute('select * from student_score')
result_set = select_statement.fetchall() #bring the results
result_set

[]

In [6]:
insert_values = [
    (10, 'Jack', 85, 92),
    (29, 'Tom', 73, 89),
    (65, 'Ram', 65.5, 77),
    (5, 'Steve', 55, 91),
]

In [7]:
insert_statement = "Insert into student_score values (?, ?, ?, ?)"
connection.executemany(insert_statement, insert_values)
connection.commit()

In [8]:
select_statement = connection.execute('select * from student_score')
resultset_2 = select_statement.fetchall()
resultset_2

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [24]:
for i in range(len(select_statement.description)):

(('Id', None, None, None, None, None, None),
 ('Name', None, None, None, None, None, None),
 ('Math', None, None, None, None, None, None),
 ('Science', None, None, None, None, None, None))

In [19]:
df_student_score = pd.DataFrame(resultset_2)
df_student_score

    0      1     2     3
0  10   Jack  85.0  92.0
1  29    Tom  73.0  89.0
2  65    Ram  65.5  77.0
3   5  Steve  55.0  91.0